kAMDSuccess = "Nedošlo k žiadnej chybe.";
kAMDUndefinedError = "Vyskytla sa neznáma chyba.";
kAMDBadHeaderError = "Nepodarilo sa preniesť súbor.";
kAMDNoResourcesError = "Nepodarilo sa alokovať zdroj.";
kAMDReadError = "Nebolo možné čítať zo zariadenia.";
kAMDWriteError = "Zápis do zariadenia nie je možný.";
kAMDUnknownPacketError = "Neznámy paket.";
kAMDInvalidArgumentError = "Argument je neplatný.";
kAMDNotFoundError = "Súbor sa nenašiel.";
kAMDIsDirectoryError = "Cesta je adresár.";
kAMDPermissionError = "Nemáte potrebné práva.";
kAMDNotConnectedError = "Nie je pripojený k zariadeniu.";
kAMDTimeOutError = "Operácii vypršal čas.";
kAMDOverrunError = "Došlo k pretečeniu buffera.";
kAMDEOFError = "Koniec súboru.";
kAMDUnsupportedError = "Operácia nie je podporovaná.";
kAMDFileExistsError = "Súbor už existuje.";
kAMDBusyError = "Zariadenie je zaneprázdnené.";
kAMDCryptoError = "Nepodarilo sa nadviazať zabezpečené spojenie so zariadením.";
kAMDTooBigError = "Správa je príliš veľká.";
kAMDInvalidResponseError = "Neočakávaná odpoveď prijatá zo zariadenia.";
kAMDMissingKeyError = "Chýba kľúč.";
kAMDMissingValueError = "Chýba hodnota.";
kAMDGetProhibitedError = "Nie je možné získať hodnotu zo zariadenia uzamknutého heslom.";
kAMDSetProhibitedError = "Nie je možné nastaviť hodnotu na zariadení.";
kAMDRemoveProhibitedError = "Nie je možné odstrániť hodnotu na zariadení.";
kAMDImmutableValueError = "Túto hodnotu nie je možné zmeniť.";
kAMDPasswordProtectedError = "Zariadenie je chránené heslom.";
kAMDMissingHostIDError = "Zariadenie nedokáže rozpoznať tohto hosta.";
kAMDInvalidHostIDError = "Zariadenie nedokáže rozpoznať tohto hosta.";
kAMDSessionActiveError = "Sedenie je aktívne.";
kAMDSessionInactiveError = "Sedenie je neaktívne.";
kAMDMissingSessionIDError = "Chýba ID sedenia.";
kAMDInvalidSessionIDError = "ID sedenia je neplatné.";
kAMDMissingServiceError = "Táto služba chýba.";
kAMDInvalidServiceError = "Služba je neplatná.";
kAMDServiceLimitError = "Už je spustených príliš veľa inštancií tejto služby.";
kAMDCheckinSetupFailedError = "Nepodarilo sa spustiť službu na zariadení";
kAMDInvalidCheckinError = "Nepodarilo sa spustiť službu na zariadení";
kAMDCheckinTimeoutError = "Služba nebola správne spustená na zariadení.";
kAMDCheckinConnectionFailedError = "Služba nebola správne spustená na zariadení.";
kAMDCheckinReceiveFailedError = "Služba nebola správne spustená na zariadení.";
kAMDCheckinResponseFailedError = "Služba nebola správne spustená na zariadení.";
kAMDCheckinOutOfMemoryError = "Služba nebola správne spustená na zariadení.";
kAMDCheckinSendFailedError = "Služba nebola správne spustená na zariadení.";
kAMDMissingPairRecordError = "Host nie je spárovaný so zariadením.";
kAMDInvalidPairRecordError = "Host už viac nie je spárovaný so zariadením.";
kAMDSavePairRecordFailedError = "Nepodarilo sa uložiť záznam párovania.";
kAMDInvalidActivationRecordError = "Aktivačný záznam je neplatný.";
kAMDMissingActivationRecordError = "Aktivačný záznam sa nenašiel.";
kAMDServiceProhibitedError = "Službu sa nepodarilo spustiť na zariadení.";
kAMDEscrowLockedError = "Zariadenie bude až do prvého odomknutia po reštarte nedostupné.";
kAMDProhibitedBySupervision = "Operácia je na riadenom zariadení zakázaná.";
kAMDPairingProhibitedError = "Párovanie je povolené len cez USB.";
kAMDWrongDroidError = "Zariadenie je v režime obnovy.";
kAMDSUVerificationError = "Balík aktualizácie softwaru sa nepodarilo overiť.";
kAMDSUPatchError = "Súbor sa nepodarilo opraviť.";
kAMDSUFirmwareError = "Nepodarilo sa aktualizovať firmware.";
kAMDProvisioningProfileNotValid = "Obstarávací profil je neplatný.";
kAMDSendMessageError = "Nepodarilo sa odoslať správu zariadeniu.";
kAMDReceiveMessageError = "Správu zo zariadenia nebolo možné prijať.";
kAMDMissingOptionsError = "Chýbajú možnosti.";
kAMDMissingImageTypeError = "Chýba obrázok.";
kAMDDigestFailedError = "Nebolo možné čítať kópiu disku.";
kAMDStartServiceError = "Službu sa nepodarilo spustiť.";
kAMDInvalidDiskImageError = "Obraz disku je neplatný.";
kAMDMissingDigestError = "Chýba zhrnutie.";
kAMDMuxError = "Vyskytla sa chyba v multiplexore USB zariadenia.";
kAMDApplicationAlreadyInstalledError = "Systémová aplikácia s daným identifikátorom balíka už je nainštalovaná na zariadení a nie je možné ju nahradiť.";
kAMDApplicationMoveFailedError = "Aplikáciu sa nepodarilo presunúť na zariadenie.";
//kAMDApplicationSINFCaptureFailedError = "";
kAMDApplicationSandboxFailedError = "Aplikáciu sa nepodarilo spustiť v prostredí sandbox.";
kAMDApplicationVerificationFailedError = "Aplikáciu sa nepodarilo overiť.";
kAMDArchiveDestructionFailedError = "Archív aplikácie sa nepodarilo odstrániť.";
kAMDBundleVerificationFailedError = "Balík operátora sa nepodarilo overiť.";
kAMDCarrierBundleCopyFailedError = "Nepodarilo sa nainštalovať balík operátora.";
kAMDCarrierBundleDirectoryCreationFailedError = "Nepodarilo sa vytvoriť adresár balíka operátora.";
kAMDCarrierBundleMissingSupportedSIMsError = "Pre tohto operátora nie sú žiadne podporované SIM.";
kAMDCommCenterNotificationFailedError = "Nepodarilo sa prijať notifikáciu z pásma.";
kAMDContainerCreationFailedError = "Nepodarilo sa vytvoriť zásobník aplikácie.";
kAMDContainerP0wnFailedError = "Práva zásobníka aplikácie sa nepodarilo opraviť.";
kAMDContainerRemovalFailedError = "Kontajner aplikácie sa nepodarilo odstrániť.";
kAMDEmbeddedProfileInstallFailedError = "Nepodarilo sa nainštalovať vstavaný obstarávací profil.";
kAMDErrorError = "Vyskytla sa chyba.";
kAMDExecutableTwiddleFailedError = "Nepodarilo sa zmeniť práva spúšťacieho súboru aplikácie.";
kAMDExistenceCheckFailedError = "Nepodarilo sa overiť, či už aplikácia existuje.";
kAMDInstallMapUpdateFailedError = "Nepodarilo sa aktualizovať zoznam nainštalovaných aplikácií.";
kAMDManifestCaptureFailedError = "Nepodarilo sa uložiť diagnostický program aplikácie.";
kAMDMapGenerationFailedError = "Nepodarilo sa vytvoriť zoznam aplikácií.";
kAMDMissingBundleExecutableError = "Balík aplikácie neobsahuje spustiteľný súbor.";
kAMDMissingBundleIdentifierError = "Balík aplikácie neobsahuje platný identifikátor.";
kAMDMissingBundlePathError = "Nepodarilo sa stanoviť cestu balíka aplikácie.";
kAMDMissingContainerError = "Zásobník nainštalovanej aplikácie sa nenašiel.";
kAMDNotificationFailedError = "Nebolo možné zverejniť notifikáciu.";
kAMDPackageExtractionFailedError = "Balík aplikácie sa nepodarilo otvoriť.";
kAMDPackageInspectionFailedError = "Balík aplikácie sa nepodarilo skontrolovať.";
kAMDPackageMoveFailedError = "Balík aplikácie sa nepodarilo premiestniť do prechodného umiestnenia.";
kAMDPathConversionFailedError = "Nepodarilo sa previesť cestu.";
kAMDRestoreContainerFailedError = "Nepodarilo sa obnoviť kontajner aplikácie.";
kAMDSeatbeltProfileRemovalFailedError = "Nepodarilo sa odstrániť seatbelt profil aplikácie.";
kAMDStageCreationFailedError = "Nepodarilo sa vytvoriť prechodný adresár.";
kAMDSymlinkFailedError = "Nepodarilo sa vytvoriť symlink.";
kAMDiTunesArtworkCaptureFailedError = "Nepodarilo sa uložiť iTunes obal albumu.";
kAMDiTunesMetadataCaptureFailedError = "Nepodarilo sa uložiť metadáta iTunes.";
kAMDAlreadyArchivedError = "Aplikácia už je archivovaná.";
kAMDUnknownCommandError = "Zariadenie nedokáže rozpoznať príkaz.";
kAMDAPIInternalError = "Vyskytla sa interná chyba API.";
kAMDMuxCreateListenerError = "Nie je možné prijímať dáta z USB zariadení.";
kAMDMuxGetListenerError = "Nepodarilo sa získať prijímač USB.";
kAMDMuxConnectError = "Nepodarilo sa sa pripojiť k zariadeniu.";
kAMDDeviceTooNewError = "Táto aplikácia musí byť aktualizovaná.";
kAMDDeviceRefNoGood = "Toto zariadenie už nie je pripojené.";
kAMDDeviceDisconnectedError = "Toto zariadenie už nie je pripojené.";
kAMDCannotTranslateError = "Správu zo zariadenia nebolo možné preložiť.";
kAMDMobileImageMounterMissingImageSignature = "Nepodarilo sa podporiť vývoj.";
kAMDMobileImageMounterResponseCreationFailed = "Nepodarilo sa podporiť vývoj.";
kAMDMobileImageMounterMissingImageType = "Nepodarilo sa podporiť vývoj.";
kAMDMobileImageMounterMissingImagePath = "Nepodarilo sa podporiť vývoj.";
kAMDMobileImageMounterImageMapLoadFailed = "Nepodarilo sa podporiť vývoj.";
kAMDMobileImageMounterAlreadyMounted = "Nepodarilo sa podporiť vývoj.";
kAMDMobileImageMounterImageMoveFailed = "Nepodarilo sa podporiť vývoj.";
kAMDMobileImageMounterMountPathMissing = "Nepodarilo sa podporiť vývoj.";
kAMDMobileImageMounterMountPathNotEmpty = "Nepodarilo sa podporiť vývoj.";
kAMDMobileImageMounterImageMountFailed = "Nepodarilo sa podporiť vývoj.";
kAMDMobileImageMounterTrustCacheLoadFailed = "Nepodarilo sa podporiť vývoj.";
kAMDMobileImageMounterDigestFailed = "Nepodarilo sa podporiť vývoj.";
kAMDMobileImageMounterDigestCreationFailed = "Nepodarilo sa podporiť vývoj.";
kAMDMobileImageMounterImageVerificationFailed = "Nepodarilo sa podporiť vývoj.";
kAMDMobileImageMounterImageInfoCreationFailed = "Nepodarilo sa podporiť vývoj.";
kAMDMobileImageMounterImageMapStoreFailed = "Nepodarilo sa podporiť vývoj.";
kAMDDeviceOSVersionTooLow = "Verzia OS je príliš stará.";
kAMDNoWifiSyncSupportError = "Zariadenie nepodporuje bezdrôtovú synchronizáciu.";
kAMDDeviceFamilyNotSupported = "Táto aplikácia nepodporuje tento typ zariadenia.";
kAMDPackagePatchFailedError = "Opravnú aktualizáciu sa na aplikáciu nepodarilo použiť.";
kAMDIncorrectArchitectureError = "Táto aplikácia nepodporuje tento typ CPU zariadenia.";
kAMDPluginCopyFailedError = "Modul VPN sa nepodarilo skopírovať do zásobníka aplikácie.";
kAMDBreadcrumbFailedError = "Nepodarilo sa zapísať navigačný prvok breadcrumb inštalácie.";
kAMDBreadcrumbUnlockError = "Nepodarilo sa aktualizovať navigačný prvok breadcrumb inštalácie.";
kAMDGeoJSONCaptureFailedError = "Nepodarilo sa uložiť dáta GeoJSON.";
kAMDNewsstandArtworkCaptureFailedError = "Nepodarilo sa uložiť obal albumu Newsstand.";
kAMDMissingCommandError = "Požiadavka neobsahovala príkaz.";
kAMDNotEntitledError = "Žiadajúca aplikácia nemá povolenie na vytváranie takejto požiadavky.";
kAMDMissingPackagePathError = "Požiadavke chýbala cesta k balíku.";
kAMDMissingContainerPathError = "Požiadavke chýbala cesta k zásobníku.";
kAMDMissingApplicationIdentifierError = "Požiadavke chýbal identifikátor aplikácie.";
kAMDMissingAttributeValueError = "Požiadavke chýbala vyžadovaná hodnota.";
kAMDLookupFailedError = "Nepodarilo sa vytvoriť zoznam nainštalovaných aplikácií.";
kAMDDictCreationFailedError = "Možnosti z požiadavky sa nepodarilo extrahovať.";

/* kMISFileError */
"A file operation failed." = "Operácia súboru zlyhala.";

/* kMISModifiedResourcesError */
"A signed resource has been added, modified, or deleted." = "Podpísaný zdroj bol pridaný, upravený alebo vymazaný.";

/* kMISInvalidSignerError */
"A valid provisioning profile for this executable was not found." = "Platný obstarávací profil pre tento spustiteľný súbor sa nenašiel.";

/* kMISUnknownError */
"An unknown error has occurred." = "Vyskytla sa neznáma chyba.";

/* kMISNotMutableError */
"Attempted to modify an immutable provisioning profile." = "Pokus o zmenu nemenného obstarávacieho profilu.";

/* kMISApplicationSignatureNotValidError */
"The application does not have a valid signature." = "Aplikácia nemá platný podpis.";

/* kMISApplicationSignatureNotValidError */
"The application's signature is valid but it does not match the expected hash." = "Podpis aplikácie je platný, avšak nesúhlasí s očakávaným hashom.";

/* kMISAdHocSignatureError */
"The executable contains an invalid signature." = "Spustiteľný súbor obsahuje neplatný podpis.";

/* kMISInvalidEntitlementError */
"The executable was signed with invalid entitlements." = "Spustiteľný súbor bol podpísaný neplatnou autorizáciou.";

/* kMISInvalidSignerCertError */
"The identity used to sign the executable is no longer valid." = "Identita, použitá na podpísanie spustiteľného súboru viac nie je platná.";

/* kMISSignatureNotValidError */
"The signature was not valid." = "Podpis nebol platný.";

/* kMISConnectionClosedError */
"There was an error communicating with your device." = "Pri komunikácii s vašim zariadením došlo k chybe.";

/* kMISUnsupportedDeviceError */
"This provisioning profile cannot be installed on this device." = "Tento obstarávací profil nie je možné nainštalovať na toto zariadenie.";

/* kMISProfileSignatureNotValidError */
"This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature)." = "Tento obstarávací profil nemá platný podpis (alebo má platný, ale nedôveryhodný podpis).";

/* kMISExpiredError */
"This provisioning profile has expired." = "Tento obstarávací profil vypršal.";

/* kMISMalformedProfileError */
"This provisioning profile is malformed." = "Tento obstarávací profil je poškodený.";

/* kMISUnsupportedVersionError */
"This provisioning profile is unsupported." = "Tento obstarávací profil nie je podporovaný.";

/* kMISAllocationError */
"Unable to allocate memory." = "Nie je možné alokovať pamäť.";

